# ComputeSurfaceArea Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Mesh..::..ComputeSurfaceArea Method
Mesh Class See Also
---
Computes and returns the surface area of the mesh. The surface area is the sum of the areas of the constituent facets of the mesh.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public double ComputeSurfaceArea()
```

Visual Basic
---
```text
Public Function ComputeSurfaceArea As Double
```

Visual C++
---
```text
public:
double ComputeSurfaceArea()
```

# ### Return Value
A double, representing the surface area.
# See Also
Mesh Class
Autodesk.Revit.DB Namespace